## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.AzureFunction.azurerm_role_assignment.func_access_to_sa_data_blobs will be created
  + resource "azurerm_role_assignment" "func_access_to_sa_data_blobs" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "7e1af2e9-d805-45c6-80e9-be08d6b6fccf"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Contributor"
      + scope                            = "/subscriptions/5782fb3c-e93b-4920-8f22-6b2038fbfa9f/resourceGroups/rg-ecowitt-test-euw/providers/Microsoft.Storage/storageAccounts/saecowittdatatesteuw01"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.AzureFunction.azurerm_windows_function_app.fapp will be updated in-place
  ~ resource "azurerm_windows_function_app" "fapp" {
      ~ app_settings                                   = {
          + "CONFIG_STORAGE"                           = "saecowittdatatesteuw01"
          - "WEBSITE_ENABLE_SYNC_UPDATE_SITE"          = "true" -> null
          - "WEBSITE_RUN_FROM_PACKAGE"                 = "1" -> null
            # (6 unchanged elements hidden)
        }
        id                                             = "/subscriptions/5782fb3c-e93b-4920-8f22-6b2038fbfa9f/resourceGroups/rg-ecowitt-test-euw/providers/Microsoft.Web/sites/fa-ecowitt-test-euw"
        name                                           = "fa-ecowitt-test-euw"
      ~ tags                                           = {
          - "hidden-link: /app-insights-conn-string"         = "InstrumentationKey=fd7bda94-8151-4ffd-a66c-c4a40bb82c99;IngestionEndpoint=https://westeurope-5.in.applicationinsights.azure.com/;LiveEndpoint=https://westeurope.livediagnostics.monitor.azure.com/;ApplicationId=af673be2-2022-4777-8685-9fad8a6d79f3" -> null
          - "hidden-link: /app-insights-instrumentation-key" = "fd7bda94-8151-4ffd-a66c-c4a40bb82c99" -> null
          - "hidden-link: /app-insights-resource-id"         = "/subscriptions/5782fb3c-e93b-4920-8f22-6b2038fbfa9f/resourceGroups/rg-ecowitt-test-euw/providers/microsoft.insights/components/appi-ecowitt-test-euw-01" -> null
        }
        # (32 unchanged attributes hidden)

      ~ site_config {
          ~ remote_debugging_enabled               = false -> true
            # (30 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 1 to change, 0 to destroy.
```
</details>